from telegram import InlineKeyboardButton, InlineKeyboardMarkup, Update
from telegram.ext import CallbackContext

from database.database import get_client_by_tg_id

from utils.logger import setup_logger

logger = setup_logger(__name__)

ios_text = (
    "📱 <b>Инструкции для IOS</b>\n\n"
    "<blockquote>"
    "1. Установка приложения\n"
    "• Откройте App Store\n"
    "• Установите приложение Streisand\n"
    "• После установки запустите приложение\n"
    "2. Импорт вашего VPN-профиля\n"
    "• Скопируйте ваш VLESS-ключ (который выдал бот)\n"
    "• В Streisand нажмите '+' в правом верхнем углу\n"
    "• Выберите 'Добавить из буфера'\n"
    "• Профиль автоматически появится в списке\n"
    "3. Подключение VPN\n"
    "• Нажмите на добавленный профиль\n"
    "• Разрешите создание VPN-конфигурации\n"
    "• Переключите тумблер VPN в положение ON\n"
    "4. Все готово!\n"
    "Теперь можно пользоваться VPN без ограничений." 
    "</blockquote>"
)

macos_text = (
    "💻 <b>Инструкции для MacOS</b>\n\n"
    "<blockquote>"
    "1. Установка приложения\n"
    "• Откройте App Store\n"
    "• Установите приложение Streisand\n"
    "• После установки запустите приложение\n"
    "2. Импорт вашего VPN-профиля\n"
    "• Скопируйте ваш VLESS-ключ (который выдал бот)\n"
    "• В Streisand нажмите '+' в правом верхнем углу\n"
    "• Выберите 'Добавить из буфера'\n"
    "• Профиль автоматически появится в списке\n"
    "3. Подключение VPN\n"
    "• Нажмите на добавленный профиль\n"
    "• Разрешите создание VPN-конфигурации\n"
    "• Переключите тумблер VPN в положение ON\n"
    "4. Все готово!\n"
    "Теперь можно пользоваться VPN без ограничений." 
    "</blockquote>"
)

windows_text = (
    "💻 <b>Инструкции для Windows</b>\n\n"
    "<blockquote>"
    "1. Установка\n"
    "• Скачайте Nekoray (рекомендуется)\n"
    "– Версия для Windows в формате ZIP\n"
    "• Распакуйте программу и запустите nekoray.exe\n"
    "2. Добавление профиля\n"
    "• Скопируйте ваш VLESS-ключ\n"
    "• В Nekoray нажмите “Добавить” → “Импорт из буфера обмена”\n"
    "• Профиль появится в списке\n"
    "3. Подключение\n"
    "• Щёлкните правой кнопкой по профилю\n"
    "• Нажмите “Подключиться”\n"
    "• В трее появится значок активного VPN\n"
    "4. Готово"
    "Теперь весь трафик идёт через VPN."
    "</blockquote>"
)

android_text = (
    "📱 <b>Инструкции для Android</b>\n\n"
    "<blockquote>"
    "1. Установка приложения\n"
    "• Откройте Google Play Store\n"
    "• Установите приложение v2rayNG\n"
    "• После установки запустите приложение\n"
    "2. Импорт VLESS-конфигурации\n"
    "• Скопируйте ваш VLESS-ключ (который выдал бот)\n"
    "• В v2rayNG нажмите '+'\n"
    "• Выберите 'Импорт из буфера обмена'\n"
    "• Конфигурация появится в списке\n"
    "3. Подключение VPN\n"
    "• Нажмите кнопку подключения (круглая кнопка)\n"
    "• Разрешите создание VPN-подключения\n"
    "• Индикатор должен загореться\n"
    "4. Все готово!\n"
    "Теперь можно пользоваться VPN без ограничений."
    "</blockquote>"
)


INSTRUCTIONS = {
    "iOS": ios_text,
    "MacOS": macos_text,
    "Windows": windows_text,
    "Android": android_text,
}


# === Показываем меню выбора платформы ===
def show_instructions_menu(update: Update, context: CallbackContext):
    """
    Показываем подменю с кнопками для каждой платформы.
    """
    query = update.callback_query
    query.answer()

    user_id = query.from_user.id
    user_id_str = str(query.from_user.id)
    client_data = get_client_by_tg_id(user_id_str)

    if not client_data:
        logger.info(f"🚫 Пользователь {user_id} запросил инструкции без подписки")
        query.message.reply_text("🚫 У вас пока нет оформленных подписок.")
        return

    logger.info(f"📖 Пользователь {user_id} открыл меню инструкций")

    keyboard = [
        [
            InlineKeyboardButton("🖥️ Windows", callback_data="inst_win"),
            InlineKeyboardButton("🍏 MacOS", callback_data="inst_mac"),
        ],
        [
            InlineKeyboardButton("📱 iOS", callback_data="inst_ios"),
            InlineKeyboardButton("🤖 Android", callback_data="inst_and"),
        ],
        [InlineKeyboardButton("🔙 Главное меню", callback_data="back_to_main")],
    ]

    reply_markup = InlineKeyboardMarkup(keyboard)
    query.message.edit_reply_markup(reply_markup=reply_markup)


def show_instruction_text(update: Update, context: CallbackContext, platform: str):
    """
    Вывести инструкцию для конкретной платформы.
    """
    user_id = update.callback_query.from_user.id
    logger.info(f"📘 Пользователь {user_id} открыл инструкцию для {platform}")

    query = update.callback_query
    query.answer()

    text = INSTRUCTIONS.get(platform, "Инструкция не найдена.")
    if text == "Инструкция не найдена.":
        logger.warning(f"⚠️ Инструкция для {platform} не найдена")

    keyboard = [
        [InlineKeyboardButton("🔙 Главное меню", callback_data="back_to_main")]
    ]
    reply_markup = InlineKeyboardMarkup(keyboard)

    query.message.edit_text(
        text,
        parse_mode="HTML",
        reply_markup=reply_markup,
    )



def show_instruction_platform_router(update: Update, context: CallbackContext):
    query = update.callback_query
    query.answer()
    data = query.data

    platform_map = {
        "inst_win": "Windows",
        "inst_mac": "MacOS",
        "inst_ios": "iOS",
        "inst_and": "Android",
    }

    platform = platform_map.get(data)
    if platform:
        show_instruction_text(update, context, platform)
    else:
        user_id = query.from_user.id
        logger.warning(f"⚠️ Пользователь {user_id} выбрал неизвестную платформу: {data}")
        query.message.reply_text("❌ Неизвестная платформа для инструкции.")
